angular.module('starter.services', [])

.factory('questions', function() {
  // Might use a resource here that returns a JSON array

  // Some fake testing data
  var questionList = [
  {
    id: 1,
    main_title: 'راهنمای کار با بخش اتوبوس',
    sub_title: 'برای مشاهده هزینه سفر به شهر مورد نظر خود لطفا مراحل زیر را دنبال کنید',
    img: 'img/other-bus.png',
    item_one: ' بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا ',
    item_two: ' بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا ',
    item_three: ' بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا ',
    item_four: ' بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا ',
    item_five: ' بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا '  
  },
  {
    id: 2,
    main_title: 'راهنمای کار با بخش قطار',
    sub_title: 'برای مشاهده هزینه سفر به شهر مورد نظر خود لطفا مراحل زیر را دنبال کنید',
    img: 'img/train.png',
    item_one: ' بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا ',
    item_two: ' بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا ',
    item_three: ' بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا ',
    item_four: ' بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا ',
    item_five: ' بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا  بلا بلا بلا '  
  }
  ];

  return {
    all: function() {
      return questionList;
    },
    get: function(questionId) {
      for (var i = 0; i < questionList.length; i++) {
        if (questionList[i].id === parseInt(questionId)) {
          return questionList[i];
        }
      }
      return null;
    }
  };
});
